Autodesk.Revit.UI.ProjectBrowserDataProvider.ExpandOrCollapse(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{System.Int32},System.Boolean)
Set the selected tree item as expanded
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.SelectBrowserItems(System.Collections.Generic.IList`1{System.Int32})
Set the selected tree items in UI to internal
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024